<div class="card">
    ごみ箱と書いているのに訪問していただいてありがとうございます (これは煽ってるわけではないです)。ごみの山でもがっかりしないでください。<br>
    だいたい GitHub の kofuk/experiment に入ってるやつです。このリポジトリは GPL 3.0 ってことになってるので、ここに貼ったリンク先のコードはだいたい GPL になると思います。ここに書くのは BLOG POST という分類で書くより内容がないよー、でもよさそうなので楽だなと思いました。まあ今日作ったページなので分からないですが。

    <h2>LINEのトーク履歴をパースするやつ</h2>
    パース自体は雑実装ですがすぐできました。あとは使い道を考えれば完成ですがこれが難しい。あと、ライブラリとして使える感じになってないので適当に呼び出してやる必要があります、関数を。ここは後でなんとかしたい。でもまあ「後で」みたいな抽象的な言い方だといつまで経っても取り掛からない or 完成しないです。また、現時点ではパースする以上の能力はないです。つまり集計できたりとかそういう機能はない。このあたりも後々コンパイルオプションによっては CGI フロントエンドがつくみたいなことはやりたいです。CGI って黎明期の匂いがしますね。<br>
    <a href="https://github.com/kofuk/experiment/tree/master/lh" class="inline">ソース</a>
</div>
